;(function(angular) {
    'use strict'
    angular.module('app').constant('r6s2', {
        mapId: 'r6s2',
        name: 'Australia',
        width: 868,
        height: 628,
        regions: [
            {
                id: "r6s2-1",
                name: "印度洋",
                path: "polygon(43.09% 0.64%,0.69% 3.18%,0.35% 35.99%,0.46% 98.73%,61.29% 98.41%,64.06% 80.57%,39.06% 64.49%,21.20% 72.93%,17.28% 54.62%,16.59% 40.13%,27.88% 32.01%,39.63% 18.15%)"
            },
            {
                id: "r6s2-2",
                name: "大分水岭",
                path: "polygon(69.35% 19.27%,66.94% 29.14%,69.47% 45.54%,73.04% 56.21%,75.46% 68.63%,69.82% 74.20%,67.97% 78.98%,76.27% 82.01%,78.11% 70.38%,82.49% 61.78%,83.18% 50.32%,77.42% 35.83%)"
            },
            {
                id: "r6s2-3",
                name: "大堡礁",
                path: "polygon(71.54% 9.55%,68.78% 14.81%,71.66% 20.06%,72.35% 30.73%,77.53% 35.99%,78.57% 39.81%,82.49% 36.15%,84.56% 27.55%,79.03% 18.79%)"
            },
            {
                id: "r6s2-4",
                name: "中部平原",
                path: "polygon(63.36% 39.01%,54.38% 40.29%,52.07% 53.34%,57.49% 66.08%,61.18% 76.43%,67.97% 74.52%,71.31% 71.02%,74.42% 60.99%,74.88% 53.50%)"
            },
            {
                id: "r6s2-5",
                name: "澳大利亚大盆地（大自流盆地）",
                path: "polygon(60.71% 39.97%,53.69% 43.95%,51.61% 51.59%,52.65% 57.32%,59.45% 59.71%,66.71% 54.30%,67.74% 47.61%,64.06% 41.08%)"
            },
            {
                id: "r6s2-6",
                name: "墨累河",
                path: "polygon(69.24% 68.47%,62.44% 67.20%,57.37% 69.11%,57.14% 74.68%,61.52% 77.55%,67.86% 78.03%,73.85% 80.57%,75.58% 74.84%,73.96% 70.86%)"
            },
            {
                id: "r6s2-7",
                name: "堪培拉",
                path: "polygon(74.31% 67.04%,70.85% 72.45%,74.77% 77.39%,78.23% 71.97%)"
            },
            {
                id: "r6s2-8",
                name: "墨尔本",
                path: "polygon(66.47% 75.00%,62.44% 79.78%,66.71% 84.39%,70.28% 79.14%)"
            },
            {
                id: "r6s2-9",
                name: "悉尼",
                path: "polygon(78.11% 62.90%,74.08% 68.63%,78.46% 73.25%,81.22% 67.99%)"
            },
            {
                id: "r6s2-10",
                name: "珀斯",
                path: "polygon(22.24% 61.78%,18.32% 67.36%,22.81% 71.50%,27.07% 66.24%)"
            },
            {
                id: "r6s2-11",
                name: "达尔文",
                path: "polygon(43.78% 7.48%,40.55% 13.06%,44.59% 18.15%,49.08% 13.22%)"
            },
            {
                id: "r6s2-12",
                name: "艾尔斯巨岩",
                path: "polygon(43.32% 38.22%,39.17% 43.15%,43.09% 49.52%,48.85% 45.06%)"
            }
        ],
        labels: [
            {
                "id": "r6s2-1",
                "name": "印度洋",
                writingMode: 'tb',
                fill: '#006994',
                fontSize: '24px',
                letterSpacing: '5em',
                "optimal": [
                    "8%",
                    "22%"
                ]
            },
            {
                "id": "r6s2-2",
                "name": "大分水岭",
                writingMode: 'tb',
                textAnchor: 'middle',
                fontSize: '16px',
                letterSpacing: '2em',
                transform: 'rotate(-30 665,314) translate(10, -10)',
                "optimal": [
                    "76.58%",
                    "49.21%"
                ]
            },
            {
                "id": "r6s2-3",
                "name": "大堡礁",
                writingMode: 'tb',
                fontSize: '16px',
                letterSpacing: '1em',
                transform: 'rotate(-30 640,143)',
                "optimal": ['73.73%', '22.77%']
            },
            {
                "id": "r6s2-4",
                "name": "中部平原",
                writingMode: 'tb',
                textAnchor: 'middle',
                fontSize: '16px',
                letterSpacing: '2em',
                "optimal": [
                    "64.54%",
                    "57.19%"
                ]
            },
            {
                "id": "r6s2-5",
                "name": "澳大利亚大盆地（大自流盆地）",
                textAnchor: 'middle',
                "optimal": [
                    "59.67%",
                    "49.84%"
                ]
            },
            {
                "id": "r6s2-6",
                "name": "墨累河",
                fill: '#006994',
                "optimal": [
                    "64.24%",
                    "72.63%"
                ]
            },
            {
                "id": "r6s2-7",
                "name": "堪培拉",
                fontSize: '16px',
                "optimal": [
                    "75.5%",
                    "72.5%"
                ]
            },
            {
                "id": "r6s2-8",
                "name": "墨尔本",
                textAnchor: 'middle',
                "optimal": [
                    "66.36%",
                    "79.00%"
                ]
            },
            {
                "id": "r6s2-9",
                "name": "悉尼",
                "optimal": [
                    "78.50%",
                    "68.17%"
                ]
            },
            {
                "id": "r6s2-10",
                "name": "珀斯",
                "optimal": [
                    "22.70%",
                    "66.64%"
                ]
            },
            {
                "id": "r6s2-11",
                "name": "达尔文",
                "optimal": [
                    "44.60%",
                    "12.93%"
                ]
            },
            {
                "id": "r6s2-12",
                "name": "艾尔斯巨岩",
                fill: '#FF1493',
                fontSize: '16px',
                "optimal": [
                    "43.74%",
                    "43.75%"
                ]
            }
        ]
    })
})(angular)
